Autodesk.Revit.DB.RevolvedSurface.IsValidProfileCurve(Autodesk.Revit.DB.Frame,Autodesk.Revit.DB.Curve)
Checks if the input profile curve is valid to create a surface of revolution in the given frame of reference.
Remarks:
The validity is defined as follows:
The profile curve is bounded and non-degenerate.  It is co-planar with the axis of revolution.  It lies on the xz plane of the frame.  It lies on the right side of the axis.  Only the end points of the profile curve can touch the axis.
frameOfReference:
frameOfReference is an orthonormal frame that defines a local coordinate system for the surface of revolution.
The frame can be "right-handed" or "left-handed".  The origin of the frame is the base of point of the axis of revolution. The BasisZ of the frame is the direction of the axis.
profileCurve:
The profile curve.
Returns:
True if the profile curve is valid; False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.RevolvedSurface.IsValidProfileCurve(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Curve)
Checks if the input profile curve is valid to create a surface of revolution around the given axis.
Remarks:
The validity is defined as follows:
The profile curve is bounded and non-degenerate.  It is co-planar with the axis of revolution.  It lies on only one side of the axis.  Only the end points of the profile curve can touch the axis.
axisBasePoint:
The base point of the axis of revolution.
axisDirection:
The direction of the axis.
profileCurve:
The profile curve.
Returns:
True if the profile curve is valid; False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.RevolvedSurface.GetProfileCurveInWorldCoordinates
Returns a copy of the profile curve expressed in the world coordinate system.
Returns:
A copy of the profile curve in the world coordinate system.
Since:
2017_subscription_update

Autodesk.Revit.DB.RevolvedSurface.GetProfileCurve
Returns a copy of the profile curve expressed in the surface's coordinate system.
Returns:
A copy of the profile curve.
Since:
2017

Autodesk.Revit.DB.RevolvedSurface.Create(Autodesk.Revit.DB.Frame,Autodesk.Revit.DB.Curve,System.Double,System.Double)
Creates a Surface object coincident with the surface of revolution defined by a coordinate frame, a profile curve,
and start and end angles of revolution.
Remarks:
The returned surface may not be of type RevolvedSurface - this function will create a surface of the simplest possible
type (Plane, Cylinder, etc.) that can be used to represent the required surface of revolution.
Given that the surface may be simplified, this function does not guarantee any particular parameterization of the surface.
frameOfReference:
frameOfReference is an orthonormal frame that defines a local coordinate system for the surface of revolution.
The frame can be "right-handed" or "left-handed".  The origin of the frame is the base of point of the axis of revolution. The BasisZ of the frame is the direction of the axis.
profileCurve:
The profile curve, which should satisfy the following conditions:
It is bounded and non-degenerate.  It is co-planar with the axis of revolution.  It lies on the xz plane of the frame.  It lies on the right side of the axis.  Only the end points of the profile curve can touch the axis.
startAngle:
Start angle of rotation.
The angles are measured around the axis of revolution, using the right-hand rule.
The profile curve is at the zero angle.
endAngle:
End angle of rotation.
Start angle must be less than end angle and their difference must be less than or equal to two times PI.
Returns:
The created surface. Note that this surface may not be of type RevolvedSurface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This Frame object may not be used as a local frame of reference.
-or-
The input profile curve is not valid to create a surface revolution in the given frame.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Start angle must be less than end angle and their difference must be less than or equal to two times PI.
Since:
2017

Autodesk.Revit.DB.RevolvedSurface.Create(Autodesk.Revit.DB.Frame,Autodesk.Revit.DB.Curve)
Creates a Surface object coincident with the surface of revolution defined by a coordinate frame and a profile curve.
Remarks:
The returned surface may not be of type RevolvedSurface - this function will create a surface of the simplest possible
type (Plane, Cylinder, etc.) that can be used to represent the required surface of revolution.
Given that the surface may be simplified, this function does not guarantee any particular parameterization of the surface.
frameOfReference:
frameOfReference is an orthonormal frame that defines a local coordinate system for the surface of revolution.
The frame can be "right-handed" or "left-handed".  The origin of the frame is the base of point of the axis of revolution. The BasisZ of the frame is the direction of the axis.
profileCurve:
The profile curve, which should satisfy the following conditions:
It is bounded and non-degenerate.  It is co-planar with the axis of revolution.  It lies on the xz plane of the frame.  It lies on the right side of the axis.  Only the end points of the profile curve can touch the axis.
Returns:
The created surface. Note that this surface may not be of type RevolvedSurface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This Frame object may not be used as a local frame of reference.
-or-
The input profile curve is not valid to create a surface revolution in the given frame.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.RevolvedSurface.Create(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Curve,System.Double,System.Double)
Creates a Surface object coincident with the surface of revolution defined by an axis, a profile curve,
and start and end angles of revolution.
Remarks:
The returned surface may not be of type RevolvedSurface - this function will create a surface of the simplest possible
type (Plane, Cylinder, etc.) that can be used to represent the required surface of revolution.
Given that the surface may be simplified, this function does not guarantee any particular parameterization of the surface.
axisBasePoint:
The base point of the axis of revolution.  Expected to lie within the Revit design limits Autodesk.Revit.DB.XYZ.IsWithinLengthLimits(Autodesk.Revit.DB.XYZ).
axisDirection:
The direction of the axis.
profileCurve:
The profile curve, which should satisfy the following conditions:
It is bounded and non-degenerate.  It is co-planar with the axis of revolution.  It lies on only one side of the axis.  Only the end points of the profile curve can touch the axis.
startAngle:
Start angle of rotation.
The angles are measured around the axis of revolution, using the right-hand rule.
The profile curve is at the zero angle.
endAngle:
End angle of rotation.
Start angle must be less than end angle and their difference must be less than or equal to two times PI.
Returns:
The created surface. Note that this surface may not be of type RevolvedSurface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
-or-
The input profile curve is not valid to create a surface revolution around the given axis.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
axisDirection has zero length.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Start angle must be less than end angle and their difference must be less than or equal to two times PI.
Since:
2017

Autodesk.Revit.DB.RevolvedSurface.Create(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Curve)
Creates a Surface object coincident with the surface of revolution defined by an axis and a profile curve.
Remarks:
The returned surface may not be of type RevolvedSurface - this function will create a surface of the simplest possible
type (Plane, Cylinder, etc.) that can be used to represent the required surface of revolution.
Given that the surface may be simplified, this function does not guarantee any particular parameterization of the surface.
axisBasePoint:
The base point of the axis of revolution.  Expected to lie within the Revit design limits Autodesk.Revit.DB.XYZ.IsWithinLengthLimits(Autodesk.Revit.DB.XYZ).
axisDirection:
The direction of the axis.
profileCurve:
The profile curve, which should satisfy the following conditions:
It is bounded and non-degenerate.  It is co-planar with the axis of revolution.  It lies on only one side of the axis.  Only the end points of the profile curve can touch the axis.
Returns:
The created surface. Note that this surface may not be of type RevolvedSurface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
-or-
The input profile curve is not valid to create a surface revolution around the given axis.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
axisDirection has zero length.
Since:
2017

Autodesk.Revit.DB.RevolvedSurface.Origin
Center of the circle that defines the base of the revolved surface. This is the origin of the local coordinate system associated with this revolved surface.
Since:
2017

Autodesk.Revit.DB.RevolvedSurface.YDir
X axis of the local coordinate system associated with this revolved surface.
Since:
2017

Autodesk.Revit.DB.RevolvedSurface.XDir
X axis of the local coordinate system associated with this revolved surface.
Since:
2017

Autodesk.Revit.DB.RevolvedSurface.Axis
Axis of the revolved surface. This is the Z axis of the local coordinate system associated with this revolved surface.
Since:
2017

Autodesk.Revit.DB.RevolvedSurface
A surface of revolution defined by a profile curve and a local coordinate system.
The surface is obtained by rotating the curve around Z axis of the local coordinate system.
Remarks:
The parametric equation of a surface of revolution is S(u, v) = center + C1(v)*cos(u)*xVec + C1(v)*sin(u)*yVec + C2(v)*zVec,
where the profile curve in the SurfRev's xz plane has the parametric equation (C1(t), C2(t)).
Note that the direction of X axis may agree or disagree with the chosen orientation of the surface.
Since:
2017